--здесь будем проверять результат процедур


--процедура первая

--проверка на несуществующий порт
SELECT forming_flight(1,'2019-07-13','2019-07-22',1000,48,2,1800,0,'bd','5;4');


--проверка корректности данных о существующем рейсе
SELECT forming_flight(2,'2019-07-13','2019-07-22',1000,48,2,1800,0,'Jon7','51;14');



--правильная привязка порт-старый рейс
select id_port from port_for_flight where id_flight =1;
SELECT forming_flight(1,'2019-07-13','2019-07-22',1000,50,0,1800,0,'Jon7','51;14');
select id_port from port_for_flight where id_flight =1;


--правильная вставка нового рейса
SELECT forming_flight(0,'2019-07-13','2099-07-22',10000,48,0,180,0,'Jon7','51;14');




